Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes.CutPartType Property
 Defines cut part type. Not used if CutParts is false.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ShorteningCutPartType CutPartType { get; set; }
Public Property CutPartType As View.ShorteningCutPartType
	Get
	Set
Property Value
Type: View.ShorteningCutPartType
See Also
Reference
View.ViewShorteningAttributes Class
Tekla.Structures.Drawing Namespace